tutorials/incompressible/simpleSolver/ACCM_backwardFacingStep2D/0/U
/*---------------------------------------------------------------------------*\
Caelus 7.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (44.31525 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (44.31525 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    symm-left
    {
        type            empty;
    }
    symm-right
    {
        type            empty;
    }
    top-wall
    {
        type            noSlipWall;
    }
    upstream
    {
        type            symmetryPlane;
    }
    wall
    {
        type            noSlipWall;
    }
}


// ************************************************************************* //
