tutorials/incompressible/simpleSolver/ACCM_backwardFacingStep2D/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
Caelus 7.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       32378;
    }
    outlet
    {
        type            patch;
        nFaces          83;
        startFace       32442;
    }
    symm-left
    {
        type            empty;
        nFaces          16339;
        startFace       32525;
    }
    symm-right
    {
        type            empty;
        nFaces          16339;
        startFace       48864;
    }
    top-wall
    {
        type            wall;
        nFaces          213;
        startFace       65203;
    }
    upstream
    {
        type            symmetryPlane;
        nFaces          8;
        startFace       65416;
    }
    wall
    {
        type            wall;
        nFaces          232;
        startFace       65424;
    }
)

// ************************************************************************* //
