tutorials/incompressible/simpleSolver/ACCM_backwardFacingStep2D/constant/transportProperties
/*-------------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{
	version			2.0;
	format			ascii;
	class			dictionary;
	location		"constant";
	object			transportProperties;
}

//--------------------------------------------------------------------------------

transportModel			Newtonian;

nu				nu [0 2 -1 0 0 0 0] 1.230979E-3;

//Cross Power law and Bird-Carreau non-linear viscosity models
// ----------------------------------------------------------------------------
CrossPowerLawCoeffs
{
	nu0             	nu0 [0 2 -1 0 0 0 0] 1e-06;
	nuInf           	nuInf [0 2 -1 0 0 0 0] 1e-06;
	m               	m [0 0 1 0 0 0 0] 1;
	n               	n [0 0 0 0 0 0 0] 1;
}

BirdCarreauCoeffs
{
	nu0             	nu0 [0 2 -1 0 0 0 0] 1e-06;
	nuInf           	nuInf [0 2 -1 0 0 0 0] 1e-06;
	k               	k [0 0 1 0 0 0 0] 0;
	n               	n [0 0 0 0 0 0 0] 1;
}

//------------------------------------------------------------------------------
