tutorials/incompressible/simpleSolver/ACCM_backwardFacingStep2D/constant/turbulenceProperties
/*-------------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/
FoamFile
{

	version			2.0;
	format			ascii;
	class			dictionary;
	location		"constant";
	object			turbulenceProperties;
}

//-----------------------------------------------------------------------------

simulationType			RASModel;

//-----------------------------------------------------------------------------
